ERP.belugaerp/src/InformationRegisters/бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo/бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo</name>
  <attributes>
    <name>ПротоколЗагрузкиИзSolvo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПеремещениеТоваров</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo/Forms/ФормаПросмотраПротокола/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПеремещениеТоваров", ПеремещениеТоваров); 
	Если Не ЗначениеЗаполнено(ПеремещениеТоваров) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ШаблонЗаголовка = НСтр("ru='%1: Протокол загрузки по заданию Solvo'");  
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, ПеремещениеТоваров);
	
	ОбновитьТекстПротокола();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПротокол(Команда)
	
	ОбновитьТекстПротокола();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТекстПротокола()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПеремещениеТоваров", ПеремещениеТоваров);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo.ПротоколЗагрузкиИзSolvo КАК ПротоколЗагрузкиИзSolvo
	|ИЗ
	|	РегистрСведений.бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo КАК бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo
	|ГДЕ
	|	бг_ПротоколыЗагрузкиПеремещенийПоЗаданиямSolvo.ПеремещениеТоваров = &ПеремещениеТоваров";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПротоколЗагрузкиИзSolvo = "";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПротоколЗагрузкиИзSolvo = Выборка.ПротоколЗагрузкиИзSolvo;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
